Revit 2026 API

# WallTypeFunction Property

---

The wall function.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public WallFunction Function { get; set; }
```
```vb
Public Property Function As WallFunction
	Get
	Set
```
```cpp
public:
property WallFunction Function {
	WallFunction get ();
	void set (WallFunction value);
}
```
```fsharp
member Function : WallFunction with get, set
```

#### Property Value

WallFunction

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

#### Reference

WallType Class

Autodesk.Revit.DB Namespace